rmjskhy/smartknob/firmware/.pio/libdeps/view/ESP32 BLE Keyboard/BleKeyboard.cpp
#if defined(USE_NIMBLE)
#include <NimBLEDevice.h>
#include <NimBLEServer.h>
#include <NimBLEUtils.h>
#include <NimBLEHIDDevice.h>
#else
#include <BLEDevice.h>
#include <BLEUtils.h>
#include <BLEServer.h>
#include "BLE2902.h"
#include "BLEHIDDevice.h"
#endif // USE_NIMBLE
#include "HIDTypes.h"
#include <driver/adc.h>
#include "sdkconfig.h"

#include <arduino.h>
#include "BleKeyboard.h"

#if defined(CONFIG_ARDUHAL_ESP_LOG)
  #include "esp32-hal-log.h"
  #define LOG_TAG ""
#else
  #include "esp_log.h"
  static const char* LOG_TAG = "BLEDevice";
#endif


// Report IDs:
#define KEYBOARD_ID 0x01
#define MEDIA_KEYS_ID 0x02
#define RADIAL_ID 0x03
#define RADIAL_HAPTIC_ID 0x04

static const uint8_t _hidReportDescriptor[] = {
  USAGE_PAGE(1),      0x01,          // USAGE_PAGE (Generic Desktop Ctrls)
  USAGE(1),           0x06,          // USAGE (Keyboard)
  COLLECTION(1),      0x01,          // COLLECTION (Application)
  // ------------------------------------------------- Keyboard
  REPORT_ID(1),       KEYBOARD_ID,   //   REPORT_ID (1)
  USAGE_PAGE(1),      0x07,          //   USAGE_PAGE (Kbrd/Keypad)
  USAGE_MINIMUM(1),   0xE0,          //   USAGE_MINIMUM (0xE0)
  USAGE_MAXIMUM(1),   0xE7,          //   USAGE_MAXIMUM (0xE7)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM (0)
  LOGICAL_MAXIMUM(1), 0x01,          //   Logical Maximum (1)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  REPORT_COUNT(1),    0x08,          //   REPORT_COUNT (8)
  HIDINPUT(1),        0x02,          //   INPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
  REPORT_COUNT(1),    0x01,          //   REPORT_COUNT (1) ; 1 byte (Reserved)
  REPORT_SIZE(1),     0x08,          //   REPORT_SIZE (8)
  HIDINPUT(1),        0x01,          //   INPUT (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
  REPORT_COUNT(1),    0x05,          //   REPORT_COUNT (5) ; 5 bits (Num lock, Caps lock, Scroll lock, Compose, Kana)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  USAGE_PAGE(1),      0x08,          //   USAGE_PAGE (LEDs)
  USAGE_MINIMUM(1),   0x01,          //   USAGE_MINIMUM (0x01) ; Num Lock
  USAGE_MAXIMUM(1),   0x05,          //   USAGE_MAXIMUM (0x05) ; Kana
  HIDOUTPUT(1),       0x02,          //   OUTPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
  REPORT_COUNT(1),    0x01,          //   REPORT_COUNT (1) ; 3 bits (Padding)
  REPORT_SIZE(1),     0x03,          //   REPORT_SIZE (3)
  HIDOUTPUT(1),       0x01,          //   OUTPUT (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
  REPORT_COUNT(1),    0x06,          //   REPORT_COUNT (6) ; 6 bytes (Keys)
  REPORT_SIZE(1),     0x08,          //   REPORT_SIZE(8)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM(0)
  LOGICAL_MAXIMUM(1), 0x65,          //   LOGICAL_MAXIMUM(0x65) ; 101 keys
  USAGE_PAGE(1),      0x07,          //   USAGE_PAGE (Kbrd/Keypad)
  USAGE_MINIMUM(1),   0x00,          //   USAGE_MINIMUM (0)
  USAGE_MAXIMUM(1),   0x65,          //   USAGE_MAXIMUM (0x65)
  HIDINPUT(1),        0x00,          //   INPUT (Data,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
  END_COLLECTION(0),                 // END_COLLECTION
  // ------------------------------------------------- Media Keys
  USAGE_PAGE(1),      0x0C,          // USAGE_PAGE (Consumer)
  USAGE(1),           0x01,          // USAGE (Consumer Control)
  COLLECTION(1),      0x01,          // COLLECTION (Application)
  REPORT_ID(1),       MEDIA_KEYS_ID, //   REPORT_ID (3)
  USAGE_PAGE(1),      0x0C,          //   USAGE_PAGE (Consumer)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM (0)
  LOGICAL_MAXIMUM(1), 0x01,          //   LOGICAL_MAXIMUM (1)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  REPORT_COUNT(1),    0x10,          //   REPORT_COUNT (16)
  USAGE(1),           0xB5,          //   USAGE (Scan Next Track)     ; bit 0: 1
  USAGE(1),           0xB6,          //   USAGE (Scan Previous Track) ; bit 1: 2
  USAGE(1),           0xB7,          //   USAGE (Stop)                ; bit 2: 4
  USAGE(1),           0xCD,          //   USAGE (Play/Pause)          ; bit 3: 8
  USAGE(1),           0xE2,          //   USAGE (Mute)                ; bit 4: 16
  USAGE(1),           0xE9,          //   USAGE (Volume Increment)    ; bit 5: 32
  USAGE(1),           0xEA,          //   USAGE (Volume Decrement)    ; bit 6: 64
  USAGE(2),           0x23, 0x02,    //   Usage (WWW Home)            ; bit 7: 128
  USAGE(2),           0x94, 0x01,    //   Usage (My Computer) ; bit 0: 1
  USAGE(2),           0x92, 0x01,    //   Usage (Calculator)  ; bit 1: 2
  USAGE(2),           0x2A, 0x02,    //   Usage (WWW fav)     ; bit 2: 4
  USAGE(2),           0x21, 0x02,    //   Usage (WWW search)  ; bit 3: 8
  USAGE(2),           0x26, 0x02,    //   Usage (WWW stop)    ; bit 4: 16
  USAGE(2),           0x24, 0x02,    //   Usage (WWW back)    ; bit 5: 32
  USAGE(2),           0x83, 0x01,    //   Usage (Media sel)   ; bit 6: 64
  USAGE(2),           0x8A, 0x01,    //   Usage (Mail)        ; bit 7: 128
  HIDINPUT(1),        0x02,          //   INPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
  END_COLLECTION(0),                  // END_COLLECTION
   
 0x05, 0x01,                    // Usage Page (Generic Desktop)        0
 0x09, 0x0e,                    // Usage (System Multi-Axis Controller) 2
 0xa1, 0x01,                    // Collection (Application)            4
 0x85, RADIAL_ID,                    //  Report ID (1)                      6
 0x05, 0x0d,                    //  Usage Page (Digitizers)            8
 0x09, 0x21,                    //  Usage (Puck)                       10

 0xa1, 0x02,                    //  Collection (Logical)               12
 0x15, 0x00,                    //   Logical Minimum (0)               14
 0x25, 0x01,                    //   Logical Maximum (1)               16
 0x75, 0x01,                    //   Report Size (1)                   18
 0x95, 0x01,                    //   Report Count (1)                  20
 0xa1, 0x00,                    //   Collection (Physical)             22
 0x05, 0x09,                    //    Usage Page (Button)              24
 0x09, 0x01,                    //    Usage (Vendor Usage 0x01)        26
 0x81, 0x02,                    //    Input (Data,Var,Abs)             28
 0x05, 0x0d,                    //    Usage Page (Digitizers)          30
 0x09, 0x33,                    //    Usage (Touch)                    32
 0x81, 0x02,                    //    Input (Data,Var,Abs)             34
 0x95, 0x06,                    //    Report Count (6)                 36
 0x81, 0x03,                    //    Input (Cnst,Var,Abs)             38
 0xa1, 0x02,                    //    Collection (Logical)             40
 0x05, 0x01,                    //     Usage Page (Generic Desktop)    42
 0x09, 0x37,                    //     Usage (Dial)                    44
 0x16, 0x01, 0x80,              //     Logical Minimum (-32767)        46
 0x26, 0xff, 0x7f,              //     Logical Maximum (32767)         49
 0x75, 0x10,                    //     Report Size (16)                52
 0x95, 0x01,                    //     Report Count (1)                54
 0x81, 0x06,                    //     Input (Data,Var,Rel)            56
 0x35, 0x00,                    //     Physical Minimum (0)            58
 0x46, 0x10, 0x0e,              //     Physical Maximum (3600)         60
 0x15, 0x00,                    //     Logical Minimum (0)             63
 0x26, 0x10, 0x0e,              //     Logical Maximum (3600)          65
 0x09, 0x48,                    //     Usage (Resolution Multiplier)   68
 0xb1, 0x02,                    //     Feature (Data,Var,Abs)          70
 0x45, 0x00,                    //     Physical Maximum (0)            72
 0xc0,                          //    End Collection                   74
 
 0x55, 0x0e,                    //    Unit Exponent (-2)               75
 0x65, 0x11,                    //    Unit (Centimeter,SILinear)       77
 0x46, 0x00, 0x00,              //    Physical Maximum (0)             79
 0x26, 0x00, 0x00,              //    Logical Maximum (0)              82
 0x09, 0x30,                    //    Usage (X)                        85
 0x81, 0x42,                    //    Input (Data,Var,Abs,Null)        87
 0x09, 0x31,                    //    Usage (Y)                        89
 0x46, 0x00, 0x00,              //    Physical Maximum (0)             91
 0x26, 0x00, 0x00,              //    Logical Maximum (0)              94
 0x81, 0x42,                    //    Input (Data,Var,Abs,Null)        97
 0x05, 0x0d,                    //    Usage Page (Digitizers)          99
 0x09, 0x48,                    //    Usage (Width)                    101
 0x15, 0x3a,                    //    Logical Minimum (58)             103
 0x25, 0x3a,                    //    Logical Maximum (58)             105
 0x75, 0x08,                    //    Report Size (8)                  107
 0x55, 0x0f,                    //    Unit Exponent (-1)               109
 0x35, 0x3a,                    //    Physical Minimum (58)            111
 0x45, 0x3a,                    //    Physical Maximum (58)            113
 0x81, 0x03,                    //    Input (Cnst,Var,Abs)             115
 0x55, 0x00,                    //    Unit Exponent (0)                117
 0x65, 0x00,                    //    Unit (None)                      119
 0x35, 0x00,                    //    Physical Minimum (0)             121
 0x45, 0x00,                    //    Physical Maximum (0)             123

