rmjskhy/smartknob/firmware/.pio/libdeps/view/ESP32 BLE Keyboard/BleKeyboard.cpp
 0x05, 0x0e,                    //    Usage Page (Haptic)              125
 0x09, 0x01,                    //    Usage (Simple Haptic Controller) 127
 0xa1, 0x02,                    //    Collection (Logical)             129
 0x15, 0x00,                    //     Logical Minimum (0)             131
 0x26, 0xff, 0x00,              //     Logical Maximum (255)           133
 0x09, 0x24,                    //     Usage (Repeat Count)            136
 0xb1, 0x42,                    //     Feature (Data,Var,Abs,Null)     138
 0x09, 0x24,                    //     Usage (Repeat Count)            140
 0x91, 0x42,                    //     Output (Data,Var,Abs,Null)      142
 0x15, 0x01,                    //     Logical Minimum (1)             144
 0x25, 0x07,                    //     Logical Maximum (7)             146
 0x09, 0x20,                    //     Usage (Auto Trigger)            148
 0xb1, 0x42,                    //     Feature (Data,Var,Abs,Null)     150
 0x09, 0x21,                    //     Usage (Manual Trigger)          152
 0x91, 0x42,                    //     Output (Data,Var,Abs,Null)      154
 0x25, 0x0a,                    //     Logical Maximum (10)            156
 0x09, 0x28,                    //     Usage (Waveform Cutoff Time)    158
 0xb1, 0x42,                    //     Feature (Data,Var,Abs,Null)     160
 0x75, 0x10,                    //     Report Size (16)                162
 0x26, 0xd0, 0x07,              //     Logical Maximum (2000)          164
 0x09, 0x25,                    //     Usage (Retrigger Period)        167
 0xb1, 0x42,                    //     Feature (Data,Var,Abs,Null)     169
 0x09, 0x25,                    //     Usage (Retrigger Period)        171
 0x91, 0x42,                    //     Output (Data,Var,Abs,Null)      173
 0x85, RADIAL_HAPTIC_ID,                    //     Report ID (2)                   175
 0x75, 0x20,                    //     Report Size (32)                177
 0x17, 0x37, 0x00, 0x01, 0x00,  //     Logical Minimum (65591)         179
 0x27, 0x37, 0x00, 0x01, 0x00,  //     Logical Maximum (65591)         184
 0x09, 0x22,                    //     Usage (Auto Trigger Associated Control) 189
 0xb1, 0x02,                    //     Feature (Data,Var,Abs)          191
 0x09, 0x11,                    //     Usage (Duration)                193
 0xa1, 0x02,                    //     Collection (Logical)            195
 0x05, 0x0a,                    //      Usage Page (Ordinals)          197
 0x95, 0x03,                    //      Report Count (3)               199
 0x09, 0x03,                    //      Usage (Vendor Usage 0x03)      201
 0x09, 0x04,                    //      Usage (Vendor Usage 0x04)      203
 0x09, 0x05,                    //      Usage (Vendor Usage 0x05)      205
 0x75, 0x08,                    //      Report Size (8)                207
 0x15, 0x00,                    //      Logical Minimum (0)            209
 0x25, 0xff,                    //      Logical Maximum (255)          211
 0xb1, 0x02,                    //      Feature (Data,Var,Abs)         213
 0xc0,                          //     End Collection                  215
 0x05, 0x0e,                    //     Usage Page (Haptic)             216
 0x09, 0x10,                    //     Usage (Waveform)                218
 0xa1, 0x02,                    //     Collection (Logical)            220
 0x05, 0x0a,                    //      Usage Page (Ordinals)          222
 0x95, 0x01,                    //      Report Count (1)               224
 0x15, 0x03,                    //      Logical Minimum (3)            226
 0x25, 0x03,                    //      Logical Maximum (3)            228
 0x36, 0x03, 0x10,              //      Physical Minimum (4099)        230
 0x46, 0x03, 0x10,              //      Physical Maximum (4099)        233
 0x09, 0x03,                    //      Usage (Vendor Usage 0x03)      236
 0xb1, 0x02,                    //      Feature (Data,Var,Abs)         238
 0x15, 0x04,                    //      Logical Minimum (4)            240
 0x25, 0x04,                    //      Logical Maximum (4)            242
 0x36, 0x04, 0x10,              //      Physical Minimum (4100)        244
 0x46, 0x04, 0x10,              //      Physical Maximum (4100)        247
 0x09, 0x04,                    //      Usage (Vendor Usage 0x04)      250
 0xb1, 0x02,                    //      Feature (Data,Var,Abs)         252
 0x15, 0x05,                    //      Logical Minimum (5)            254
 0x25, 0x05,                    //      Logical Maximum (5)            256
 0x36, 0x04, 0x10,              //      Physical Minimum (4100)        258
 0x46, 0x04, 0x10,              //      Physical Maximum (4100)        261
 0x09, 0x05,                    //      Usage (Vendor Usage 0x05)      264
 0xb1, 0x02,                    //      Feature (Data,Var,Abs)         266
 0x35, 0x00,                    //      Physical Minimum (0)           268
 0x45, 0x00,                    //      Physical Maximum (0)           270
 0xc0,                          //     End Collection                  272
 0xc0,                          //    End Collection                   273
 0xc0,                          //   End Collection                    274
 0xc0,                          //  End Collection                     275
 0xc0,                          // End Collection                      276
  
};

BleKeyboard::BleKeyboard(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel) 
    : hid(0)
    , deviceName(std::string(deviceName).substr(0, 15))
    , deviceManufacturer(std::string(deviceManufacturer).substr(0,15))
    , batteryLevel(batteryLevel) {}

void BleKeyboard::begin(void)
{
  BLEDevice::init(deviceName);
  BLEServer* pServer = BLEDevice::createServer();
  pServer->setCallbacks(this);

  hid = new BLEHIDDevice(pServer);
  inputKeyboard = hid->inputReport(KEYBOARD_ID);  // <-- input REPORTID from report map
  outputKeyboard = hid->outputReport(KEYBOARD_ID);
  inputMediaKeys = hid->inputReport(MEDIA_KEYS_ID);
  inputRadial = hid->inputReport(RADIAL_ID);
  outputRadial = hid->outputReport(RADIAL_ID);
  featureRadial = hid->featureReport(RADIAL_ID);
  featureRadial->setCallbacks(new radialFeatureHapticCallback(this));
  outputKeyboard->setCallbacks(this);

  hid->manufacturer()->setValue(deviceManufacturer);

  hid->pnp(0x02, 0xe502, 0xa111, 0x0210);
  hid->hidInfo(0x00, 0x01);


#if defined(USE_NIMBLE)

