rmjskhy/smartknob/firmware/.pio/libdeps/view/ESP32 BLE Keyboard/BleKeyboard.cpp
	sendReport(&_mediaKeyReport);
	return 1;
}

// release() takes the specified key out of the persistent key report and
// sends the report.  This tells the OS the key is no longer pressed and that
// it shouldn't be repeated any more.
size_t BleKeyboard::release(uint8_t k)
{
	uint8_t i;
	if (k >= 136) {			// it's a non-printing key (not a modifier)
		k = k - 136;
	} else if (k >= 128) {	// it's a modifier key
		_keyReport.modifiers &= ~(1<<(k-128));
		k = 0;
	} else {				// it's a printing key
		k = pgm_read_byte(_asciimap + k);
		if (!k) {
			return 0;
		}
		if (k & 0x80) {							// it's a capital letter or other character reached with shift
			_keyReport.modifiers &= ~(0x02);	// the left shift modifier
			k &= 0x7F;
		}
	}

	// Test the key report to see if k is present.  Clear it if it exists.
	// Check all positions in case the key is present more than once (which it shouldn't be)
	for (i=0; i<6; i++) {
		if (0 != k && _keyReport.keys[i] == k) {
			_keyReport.keys[i] = 0x00;
		}
	}

	sendReport(&_keyReport);
	return 1;
}

size_t BleKeyboard::release(const MediaKeyReport k)
{
    uint16_t k_16 = k[1] | (k[0] << 8);
    uint16_t mediaKeyReport_16 = _mediaKeyReport[1] | (_mediaKeyReport[0] << 8);
    mediaKeyReport_16 &= ~k_16;
    _mediaKeyReport[0] = (uint8_t)((mediaKeyReport_16 & 0xFF00) >> 8);
    _mediaKeyReport[1] = (uint8_t)(mediaKeyReport_16 & 0x00FF);

	sendReport(&_mediaKeyReport);
	return 1;
}

void BleKeyboard::releaseAll(void)
{
	_keyReport.keys[0] = 0;
	_keyReport.keys[1] = 0;
	_keyReport.keys[2] = 0;
	_keyReport.keys[3] = 0;
	_keyReport.keys[4] = 0;
	_keyReport.keys[5] = 0;
	_keyReport.modifiers = 0;
    _mediaKeyReport[0] = 0;
    _mediaKeyReport[1] = 0;
	sendReport(&_keyReport);
}

size_t BleKeyboard::write(uint8_t c)
{
	uint8_t p = press(c);  // Keydown
	release(c);            // Keyup
	return p;              // just return the result of press() since release() almost always returns 1
}

size_t BleKeyboard::write(const MediaKeyReport c)
{
	uint16_t p = press(c);  // Keydown
	release(c);            // Keyup
	return p;              // just return the result of press() since release() almost always returns 1
}

size_t BleKeyboard::write(const uint8_t *buffer, size_t size) {
	size_t n = 0;
	while (size--) {
		if (*buffer != '\r') {
			if (write(*buffer)) {
			  n++;
			} else {
			  break;
			}
		}
		buffer++;
	}
	return n;
}

bool BleKeyboard::dialPressed(){
  return _radialReport.button == 1;
}
void BleKeyboard::pressDial(){
  _radialReport.button = 3;
  rotate(0);
}
void BleKeyboard::releaseDial(){
  _radialReport.button = 2;
  rotate(0);
}
void BleKeyboard::rotate(int angle){
  
  _radialReport.vala = 0x0A;
  _radialReport.valb = 0x0B;
  _radialReport.valc = 0x0C;
  _radialReport.vald = 0x0D;
  _radialReport.vale = 0x3A;
  _radialReport.rotation = angle;
  if (dial_mult > 1){
    _radialReport.rotation = angle * dial_mult;
  }
  sendReport(&_radialReport);
  
}

void radialHapticCallback::onRead(BLECharacteristic* pCharacteristic){
  ESP_LOGI(LOG_TAG, "I've been read!");
}
void radialHapticCallback::onWrite(BLECharacteristic* pCharacteristic){  
  std::string buff = pCharacteristic->getValue();
  Serial.print("Written data:");
  for (int i = 0; i < buff.length(); i++){
    Serial.print(buff[i], HEX);
  }
  Serial.println();
}

radialFeatureHapticCallback::radialFeatureHapticCallback(BleKeyboard *kbd){
  pKeyboardReference = kbd;
}

void radialFeatureHapticCallback::onWrite(BLECharacteristic* pCharacteristic){  
  std::string buff = pCharacteristic->getValue();
  RadialFeatureReport *r = (RadialFeatureReport*) buff.c_str();
  
  Serial.print("Feature report data:");
  for (int i = buff.length() -1; i >= 0; i--){
    Serial.print(buff[i], HEX);
  }
  Serial.println();
  
  
  pKeyboardReference->dial_vibrate = r->enabled;
  if (r->vibration_amount == 0){
    pKeyboardReference->dial_interval = 1;
    pKeyboardReference->dial_mult = 1;
  }else if (r->vibration_amount < 100){
    pKeyboardReference->dial_interval = round(100.0 / (float)r->vibration_amount);
    pKeyboardReference->dial_mult = 1;
  } else {
    pKeyboardReference->dial_interval = 1;
    pKeyboardReference->dial_mult = (float)r->vibration_amount / 100.0;
  }
  if (pKeyboardReference->dial_interval < 2){
    pKeyboardReference->dial_vibrate = 0;
  }
  pKeyboardReference->dial_pos = 0;
  Serial.println(r->vibration_amount);
  Serial.println(pKeyboardReference->dial_interval);
  Serial.println(pKeyboardReference->dial_mult);
}

void BleKeyboard::onConnect(BLEServer* pServer) {
  this->connected = true;

#if !defined(USE_NIMBLE)

  BLE2902* desc = (BLE2902*)this->inputKeyboard->getDescriptorByUUID(BLEUUID((uint16_t)0x2902));
  desc->setNotifications(true);
  desc = (BLE2902*)this->inputMediaKeys->getDescriptorByUUID(BLEUUID((uint16_t)0x2902));
  desc->setNotifications(true);

#endif // !USE_NIMBLE

}

void BleKeyboard::onDisconnect(BLEServer* pServer) {
  this->connected = false;

#if !defined(USE_NIMBLE)

  BLE2902* desc = (BLE2902*)this->inputKeyboard->getDescriptorByUUID(BLEUUID((uint16_t)0x2902));
  desc->setNotifications(false);
  desc = (BLE2902*)this->inputMediaKeys->getDescriptorByUUID(BLEUUID((uint16_t)0x2902));
  desc->setNotifications(false);

  advertising->start();

#endif // !USE_NIMBLE
}

void BleKeyboard::onWrite(BLECharacteristic* me) {
  uint8_t* value = (uint8_t*)(me->getValue().c_str());
  (void)value;
  ESP_LOGI(LOG_TAG, "special keys: %d", *value);
}

void BleKeyboard::delay_ms(uint64_t ms) {
  uint64_t m = esp_timer_get_time();
  if(ms){
    uint64_t e = (m + (ms * 1000));
    if(m > e){ //overflow
        while(esp_timer_get_time() > e) { }
    }
    while(esp_timer_get_time() < e) {}
  }
}